// idioms.js
const idiomsData = [
  {
    name: "凤毛麟角",
    pinyin: "fèngmáo línjiǎo",
    meaning: "比喻珍贵而稀少的人或事物",
    synonyms: ["百里挑一", "屈指可数", "寥若晨星"],
    antonyms: ["比比皆是", "多如牛毛", "车载斗量"],
    comparison: "与'百里挑一'相比,'凤毛麟角'更强调珍贵性和稀有程度",
    example: "初冬寒潮中,对接会暖意融融。国电投核力创芯（无锡）科技有限公司的HR王可此行目标明确,一到现场,她便迅速锁定西安交通大学和华中科技大学两所国内名校。“招聘名额少、人才要求高,长期以来招工难的核心在于如何精准‘锁’才。”王可坦言,以往参与综合性招聘会犹如大海捞针,简历收了不少,能适配岗位需求的人才却凤毛麟角。此次政校企对接平台,让她和学校老师“面对面”,由老师直接推荐对口专业的师生,“无疑为我们精准揽才按下‘加速键’。”。"
  },
  {
    name: "吉光片羽",
    pinyin: "jí guāng piàn yǔ",
    meaning: "比喻残存的珍贵文物",
    synonyms: ["无价之宝", "凤毛麟角", "奇珍异宝"],
    antonyms: ["比比皆是"],
    comparison: "与'凤毛麟角'相比,'吉光片羽'更强调文化遗产的珍贵片段",
    example: "9月24日上午，习近平总书记在乌鲁木齐文化中心展览馆参观新疆维吾尔自治区成立70周年主题成就展。\
              七十载岁月如歌。从积贫积弱到生机勃勃，天山南北创造的人间奇迹，彪炳史册。\
              石榴花何以常开长盛，石榴籽何以紧紧相拥？\
              历史的动线，往往藏于时间的吉光片羽之中。这场总书记看过的展览里，有过去的动人故事，也有当代的深刻启示"
  }
];

module.exports = idiomsData;
